{
  "header": {
    "logo": "KamilNawrot",
    "menu": [
      {
        "name": "about me",
        "path": "/#about"
      },
      {
        "name": "portfolio",
        "path": "#projects"
      },
      
      {
        "name": "contact",
        "path": "/#contact"
      }
    ],
    "languages": ["en", "pl"]
  },
  "heroImage": {
    "headline": "Hello world! I'm Kamil, an aspiring front-end developer",
    "buttonText": "Get to know each other better!",
    "description": "I'm passionate programmer who decided to settle his home within the browser. I'm highly motivated, eager to learn and hone my skills in the field of web development!"
  },
  "aboutSection": {
    "headline": "Discover what I can help you with",
    "perks": [
      {
        "name": "Solid background",
        "description": "I graduated in Control Engineering and Robotics with Bachelor's degree and completed Master's programme in Computer Engineering with an excellent final grade. Diversity of courses during five years of studies equipped me with broad range of solutions for many IT-related problems. I have strong foundations in mathematics, algorithms, computer networks, low-level programming, project management, machine learning, and many more.",
        "icon": "FaGraduationCap"
      },
      {
        "name": "Attention to detail",
        "description": "I want every project I'm involved in to be the best possible version of itself. I always attach great importance to externally insignificant details and try to learn something new on the way. My passion for good-looking design results in visually appealing projects.",
        "icon": "FiTarget"
      },
      {
        "name": "Real passion",
        "description": "Computers and programming are in my area of interest since childhood. After I created my first website in pure HTML, it became a real passion. Working as a programmer gives me true joy and I'm constatly looking for new challenges to become better developer.",
        "icon": "FaStar"
      }
    ],
    "resumeForm": {
      "description": "If you are interested in more detailed description of me as a web developer, you may find resume valuable source of information. Download it in PDF format using the button below.",
      "buttonText": "Download resume",
      "socialLinks": {
        "facebook": "https://facebook.com",
        "github": "https://github.com/kamil-nawrot",
        "linkedin": "https://linkedin.com/in/kamil-nawrot"
      },
      "technologies": ["React", "Redux", "HTML", "CSS", "JavaScript", "WordPress", "node.js"]
    }
  },
  "projectsSection": {
    "headline": "Check out examples of my expertise",
    "projects": [
      {
        "title": "iCinema",
        "description": "Single Page Application written with React with node.js back-end and simple MongoDB set up. It mocks up the process of booking tickets for screenings, utilising The Movie Database for retrieving information about films.",
        "imagePath": "sample-project-bg"
      },
      {
        "title": "COVID-19 Detector",
        "description": "Master thesis topic",
        "imagePath": "sample-project-bg-2"
      },
      {
        "title": "It is a conscious disconnection",
        "description": "The dosi is surprisingly biological. Pathways malfunction with devastation at the lunar habitat neveraccelerative, indeed!",
        "imagePath": "sample-project-bg-3"
      },
      {
        "title": "Cum olla peregrinatione",
        "description": "Bi-color lanista hic imperiums uria est. Pes grandis homo est. Danista, cacula, et indictio.",
        "imagePath": "sample-project-bg-4"
      }
    ]
  },
  "contactSection": {
    "headline": "Let's get in touch!",
    "contactForm": {
      "fields": [
        {
          "name": "Your name",
          "type": "text"
        },
        {
          "name": "Your mail address",
          "type": "text"
        },
        {
          "name": "Your message",
          "type": "textarea"
        }
      ],
      "buttonText": "Send message",
      "title": "Moons harvest from ellipses",
      "description": "If you have any idea, remarks, proposition of cooperation or just want to talk, don't hesitate to contact me. I will always try to answer as soon as possible. You can also use other social channels linked below if you prefer.",
      "messages": {
        "success": "Form was sent successfully.",
        "fail": "An unexpected error occured. Form was not sent."
      }
    }
  },
  "footer": {
    "text": "Abnoba, hibrida, et devatio. Orgias sunt vortexs de magnum rumor."
  },
  "notFound": {
    "headline": "Unfortunately, there's nothing here.",
    "text": "But don't worry, here's something that'll bring you back on track:",
    "buttonText": "Back to homepage"
  }
}