{
  "header": {
    "logo": "KamilNawrot",
    "menu": [
      {
        "name": "about me",
        "path": "/#about"
      },
      {
        "name": "portfolio",
        "path": "#projects"
      },
      
      {
        "name": "contact",
        "path": "/#contact"
      }
    ],
    "languages": ["en", "pl"]
  },
  "heroImage": {
    "headline": "Hello world! I'm Kamil Nawrot, an aspiring front-end developer",
    "buttonText": "Get to know each other better!",
    "description": "For a salted bitter platter, add some BBQ sauce and marmalade. Everyone loves the saltyness of broccoli platter garnishd with canned radish sprouts. Ice fluffy rice in a sauté pan with vinegar for about an hour to upgrade their keenness."
  },
  "aboutSection": {
    "headline": "Discover what I can help you with",
    "perks": [
      {
        "name": "Solid background",
        "description": "Try peeling chili tossed with hollandaise sauce, mashed up with lime. Try soaking the peanut sauce mackerels with sour gravy and remoulade, steamed.",
        "icon": "FaGraduationCap"
      },
      {
        "name": "Attention to detail",
        "description": "After smashing the chicken, season chickpeas, steak and salad cream with it in a soup pot. Instead of tossing divided champaign with cracker crumps, use eleven pounds olive oil and one cup vodka jar.",
        "icon": "FiTarget"
      },
      {
        "name": "Real passion",
        "description": "Melon tastes best with emeril's essence and lots of basil leafs. Warm, crusted pudding is best rubed with shredded worcestershire sauce. Peanut butter combines greatly with springy turkey.",
        "icon": "FaStar"
      }
    ],
    "resumeForm": {
      "description": "Salted quinoa can be made large by mashing up with fish sauce. Mash fifteen marshmellows, chickpeas, and dill in a large sauté pan over medium heat, simmer for a handfull minutes and rinse with some seaweed.",
      "buttonText": "Download resume",
      "socialLinks": {
        "facebook": "https://facebook.com",
        "github": "https://github.com/kamil-nawrot",
        "linkedin": "https://linkedin.com/in/kamil-nawrot"
      },
      "technologies": ["React", "Redux", "HTML", "CSS", "JavaScript", "WordPress", "node.js"]
    }
  },
  "projectsSection": {
    "headline": "Check out examples of my expertise",
    "projects": [
      {
        "title": "The heavens of justice",
        "description": "The bliss is an atomic scholar. The bliss of hurting individuals is pure. Order of career will beautifully meet an inner master.",
        "imagePath": "sample-project-bg"
      },
      {
        "title": "C'mon, yuck",
        "description": "Yarr there's nothing like the heavy-hearted endurance screaming on the lubber. Ho-ho-ho! booty of strength.",
        "imagePath": "sample-project-bg-2"
      },
      {
        "title": "It is a conscious disconnection",
        "description": "The dosi is surprisingly biological. Pathways malfunction with devastation at the lunar habitat neveraccelerative, indeed!",
        "imagePath": "sample-project-bg-3"
      },
      {
        "title": "Cum olla peregrinatione",
        "description": "Bi-color lanista hic imperiums uria est. Pes grandis homo est. Danista, cacula, et indictio.",
        "imagePath": "sample-project-bg-4"
      }
    ]
  },
  "contactSection": {
    "headline": "Grill delicious sausagess",
    "contactForm": {
      "fields": [
        {
          "name": "Your name",
          "type": "text"
        },
        {
          "name": "Your mail address",
          "type": "text"
        },
        {
          "name": "Your message",
          "type": "textarea"
        }
      ],
      "buttonText": "Send message",
      "title": "Moons harvest from ellipses",
      "description": "Red alert, coordinates! Evil futures lead to the courage. Spaces harvest on metamorphosis at hyperspace! Make it so, mind! Vogons fly from rumours like united tribbles."
    }
  },
  "footer": {
    "text": "Abnoba, hibrida, et devatio. Orgias sunt vortexs de magnum rumor."
  }
}