{
  "header": {
    "logo": "KamilNawrot",
    "menu": [
      {
        "name": "o mnie",
        "path": "pl/#about"
      },
      {
        "name": "portfolio",
        "path": "pl/#projects"
      },
      {
        "name": "kontakt",
        "path": "pl/#contact"
      }
    ],
    "languages": ["en", "pl"]
  },
  "heroImage": {
    "headline": "Cześć! Jestem Kamil, aspirujący front-end developer",
    "buttonText": "Poznajmy się lepiej!",
    "description": "Jestem pasjonatem programowania, który po poznaniu szerokiego wachlarza języków i środowisk zdecydował na stałe osiedlić się wewnątrz przeglądarki. Jestem zmotywowany, aby rozwijać swoją karierę i szlifować umiejętności w obszarze web developmentu."
  },
  "aboutSection": {
    "title": "Sprawdź, kim jestem, i w czym mogę Ci pomóc",
    "perks": [
      {
        "name": "Solidne podstawy",
        "description": "Ukończyłem studia inżynierskie na kierunku Automatyka i Robotyka, oraz magisterskie na kierunku Computer Engineering - dało mi to możliwość zdobycia wiedzy i umiejętności z wielu dziedzin związanych z branżą IT: od matematycznych i algorytmicznych podstaw, poprzez programowanie niskopoziomowe, aż po zagadnienia uczenia maszynowego i zarządzania projektami.",
        "icon": "FaGraduationCap"
      },
      {
        "name": "Precyzja i staranność",
        "description": "Każdemu projektowi, w który się angażuję, poświęcam pełnię swojej uwagi i dokładam wszelkich starań, aby efekt końcowy był dopracowany w najmniejszym szczególe.",
        "icon": "FiTarget"
      },
      {
        "name": "Prawdziwa pasja",
        "description": "Komputery i programowanie znajdują się w moim kręgu zainteresowań już od dziecka. Stworzenie pierwszej strony internetowej w czystym HTML zamieniło zainteresowanie w pasję. Każdy projekt jest dla mnie nową przygodą, a zarazem wyzwaniem.",
        "icon": "FaStar"
      }
    ],
    "resumeForm": {
      "description": "Jeśli moja osoba zainteresowała Cię w kontekście ewentualnej współpracy, użyj przycisku poniżej aby pobrać moje CV i dowiedzieć się więcej.",
      "buttonText": "Pobierz CV",
      "socialLinks": {
        "facebook": "https://facebook.com",
        "github": "https://github.com/kamil-nawrot",
        "linkedin": "https://linkedin.com/in/kamil-nawrot"
      },
      "technologies": ["React", "Redux", "HTML", "CSS", "JavaScript", "WordPress", "node.js"]
    }
  },
  "projectsSection": {
    "headline": "Przekonaj się, co potrafię stworzyć",
    "projects": [
      {
        "title": "COVID-19 Detector",
        "description": "Silnik wykorzystujący uczenie maszynowe i sieci neuronowe do wykrywania przypadków COVID-19 na podstawie zdjęć rentgenowskich płuc; temat mojej pracy magisterskiej, napisany w Pythonie z wykorzystaniem biblioteki TensorFlow.",
        "imagePath": "covid19-detector",
        "url": "https://github.com/kamil-nawrot/master-thesis"
      },
      {
        "title": "iCinema",
        "description": "Projekt typu SPA, napisany z wykorzystaniem Reacta oraz back-endu w node.js zawierającego prostą bazę danych MongoDB; aplikacja symulująca procedurę rezerwacji biletów kinowych, połączona z filmową bazą danych The Movie Database.",
        "imagePath": "icinema",
        "url": "https://github.com/kamil-nawrot/iCinema"
      },
      {
        "title": "Personal Website",
        "description": "Portfolio wygenerowane z pomocą narzędzia Gatsby, działającego z wykorzystaniem infrastruktury i składni Reacta; zaprojektowane i zaimplementowane zupełnie od zera.",
        "imagePath": "personal-website",
        "url": "https://github.com/kamil-nawrot/portfolio-website"
      },
      {
        "title": "World Explorer",
        "description": "Gra oparta o geografię i mape, polegająca na odgadywaniu nazw miast z całego świata; aktualnie w fazie rozwoju, niedostępna publicznie.",
        "imagePath": "world-explorer"
      }
    ]
  },
  "contactSection": {
    "headline": "Skontaktuj się ze mną",
    "contactForm": {
      "fields": [
        {
          "name": "Twoje imię",
          "type": "text"
        },
        {
          "name": "Twój adres e-mail",
          "type": "text"
        },
        {
          "name": "Twoja wiadomość",
          "type": "textarea"
        }
      ],
      "buttonText": "Wyślij",
      "title": "Czekam na Twoją wiadomość!",
      "description": "Jeśli masz jakiekolwiek uwagi, przemyślenia, lub propozycje współpracy - nie wahaj się, skorzystaj z formularza kontaktowego. Postaram się odpowiedzieć najszybciej, jak będę w stanie. Do kontaktu możesz też wykorzystać kanały społecznosciowe widoczne poniżej.",
      "messages": {
        "success": "Zapytanie zostało wysłane.",
        "fail": "Wystąpił nieoczekiwany błąd. Formularz nie został przesłany."
      }
    }
  },
  "footer": {
    "text": "Abnoba, hibrida, et devatio. Orgias sunt vortexs de magnum rumor."
  },
  "notFound": {
    "headline": "Ups, nic tutaj nie ma.",
    "text": "Nie przejmuj się, tutaj jest coś, co zabierze Cię z powrotem na właściwe tory:",
    "buttonText": "Powrót do strony głównej"
  }
}